#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[33mRunning plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.[0m

Preparing the remote plan...
[0m
[0m[33mTo view this run in a browser, visit:
https://app.terraform.io/app/dsl-2022/gh-multi-channel-message/runs/run-7MvAMUqdP67E5N2w[0m
[0m
Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
[0m[1mdata.local_file.schema: Reading...[0m[0m
[0m[1mdata.local_file.schema: Read complete after 0s [id=6358b37422409054d8c873b6da46860840cadb57][0m
[0m[1mdata.aws_iam_policy_document.lambda_document: Reading...[0m[0m
[0m[1maws_iam_role.ddb_resolver: Refreshing state... [id=ddb_resolver][0m
[0m[1maws_dynamodb_table.message_channel: Refreshing state... [id=message-channel][0m
[0m[1mdata.aws_iam_policy_document.lambda_assume_role_document: Reading...[0m[0m
[0m[1maws_dynamodb_table.message_channel_messages: Refreshing state... [id=message-channel-messages][0m
[0m[1mdata.aws_iam_policy_document.lambda_document: Read complete after 0s [id=2516577437][0m
[0m[1mdata.aws_iam_policy_document.datasource_assume_role: Reading...[0m[0m
[0m[1mdata.aws_iam_policy_document.lambda_assume_role_document: Read complete after 0s [id=3693445097][0m
[0m[1maws_appsync_graphql_api.message_channel: Refreshing state... [id=qrtb7xdnvjalhbifiyb5c57ame][0m
[0m[1maws_iam_policy.lambda_policy: Refreshing state... [id=arn:aws:iam::212612999379:policy/terraform-20220611235900023900000001][0m
[0m[1mdata.aws_iam_policy_document.datasource_assume_role: Read complete after 0s [id=2027410878][0m
[0m[1maws_iam_role.lambda_role: Refreshing state... [id=test-appsync-04-09-role][0m
[0m[1maws_iam_role.lambda_datasource_role: Refreshing state... [id=test-appsync-04-09-appsync-lambda-datasource][0m
[0m[1maws_appsync_datasource.add_message: Refreshing state... [id=qrtb7xdnvjalhbifiyb5c57ame-add_messages][0m
[0m[1maws_appsync_datasource.add_channel: Refreshing state... [id=qrtb7xdnvjalhbifiyb5c57ame-tf_appsync_example][0m
[0m[1maws_iam_role_policy.ddb_resolver_policy: Refreshing state... [id=ddb_resolver:ddb_resolver_policy][0m
[0m[1maws_appsync_datasource.query_channel: Refreshing state... [id=qrtb7xdnvjalhbifiyb5c57ame-query_channel][0m
[0m[1maws_iam_policy_attachment.lambda_attachment: Refreshing state... [id=test-appsync-04-09-attachment][0m
[0m[1maws_appsync_resolver.add_channel_message_resolver: Refreshing state... [id=qrtb7xdnvjalhbifiyb5c57ame-Mutation-createMessage][0m
[0m[1maws_appsync_resolver.add_channel_resolver: Refreshing state... [id=qrtb7xdnvjalhbifiyb5c57ame-Mutation-createChannel][0m
[0m[1maws_appsync_resolver.get_all_channel_resolver: Refreshing state... [id=qrtb7xdnvjalhbifiyb5c57ame-Query-getAllChannels][0m
[0m[1maws_appsync_resolver.get_channel_resolver: Refreshing state... [id=qrtb7xdnvjalhbifiyb5c57ame-Query-getChannel][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # aws_appsync_datasource.get_messages[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_appsync_datasource" "get_messages" {
      [32m+[0m [0m[1m[0mapi_id[0m[0m           = "qrtb7xdnvjalhbifiyb5c57ame"
      [32m+[0m [0m[1m[0marn[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m             = "get_messages"
      [32m+[0m [0m[1m[0mservice_role_arn[0m[0m = "arn:aws:iam::212612999379:role/ddb_resolver"
      [32m+[0m [0m[1m[0mtype[0m[0m             = "AMAZON_DYNAMODB"

      [32m+[0m [0mdynamodb_config {
          [32m+[0m [0m[1m[0mregion[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0mtable_name[0m[0m = "message-channel-messages"
        }
    }

[1m  # aws_appsync_resolver.get_all_messages_resolver[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_appsync_resolver" "get_all_messages_resolver" {
      [32m+[0m [0m[1m[0mapi_id[0m[0m            = "qrtb7xdnvjalhbifiyb5c57ame"
      [32m+[0m [0m[1m[0marn[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mdata_source[0m[0m       = "get_messages"
      [32m+[0m [0m[1m[0mfield[0m[0m             = "getAllMessages"
      [32m+[0m [0m[1m[0mid[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mkind[0m[0m              = "UNIT"
      [32m+[0m [0m[1m[0mrequest_template[0m[0m  = <<-EOT
                    {
                    "version" : "2017-02-28",
                    "operation" : "Query",
                     "query":{
                     	"expression":"#type = :type",
                        "expressionNames":{
                        	"#type":"type"
                        },
                        "expressionValues":{
                        	":type": $util.dynamodb.toDynamoDBJson("message")
                        }
                     },
                     "index":"sort-by-nummber-id",
                     "scanIndexForward":true
                     "filter": {
                        "expression": "contains (channel, :channel)",
                        "expressionValues": {
                        ":channel": $util.dynamodb.toDynamoDBJson($context.arguments.channel)
                      }
                    }    
                    #if( $context.arguments.count )
                        ,"limit": $util.toJson($context.arguments.count)
                    #end
                    #if( $context.arguments.nextToken )
                        ,"nextToken": $util.toJson($context.arguments.nextToken)
                    #end
                }
        EOT
      [32m+[0m [0m[1m[0mresponse_template[0m[0m = <<-EOT
                  {
                "channels": $util.toJson($context.result.items)
                #if( $context.result.nextToken )
                    ,"nextToken": $util.toJson($context.result.nextToken)
                #end
            }
        EOT
      [32m+[0m [0m[1m[0mtype[0m[0m              = "Query"

      [32m+[0m [0mcaching_config {
          [32m+[0m [0m[1m[0mcaching_keys[0m[0m = [
              [32m+[0m [0m"$context.arguments.id",
              [32m+[0m [0m"$context.identity.sub",
            ]
          [32m+[0m [0m[1m[0mttl[0m[0m          = 60
        }
    }

[0m[1mPlan:[0m 2 to add, 0 to change, 0 to destroy.
[0m[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValue for undeclared variable[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
[33m│[0m [0mbut a value was found in file
[33m│[0m [0m"/home/tfc-agent/.tfc-agent/component/terraform/runs/run-7MvAMUqdP67E5N2w/terraform.tfvars".
[33m│[0m [0mIf you meant to use this value, add a "variable" block to the
[33m│[0m [0mconfiguration.
[33m│[0m [0m
[33m│[0m [0mTo silence these warnings, use TF_VAR_... environment variables to provide
[33m│[0m [0mcertain "global" settings to all configurations in your organization. To
[33m│[0m [0mreduce the verbosity of these warnings, use the -compact-warnings option.
[33m╵[0m[0m
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mValue for undeclared variable[0m
[33m│[0m [0m
[33m│[0m [0m[0mThe root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
[33m│[0m [0mvalue was found in file
[33m│[0m [0m"/home/tfc-agent/.tfc-agent/component/terraform/runs/run-7MvAMUqdP67E5N2w/terraform.tfvars".
[33m│[0m [0mIf you meant to use this value, add a "variable" block to the
[33m│[0m [0mconfiguration.
[33m│[0m [0m
[33m│[0m [0mTo silence these warnings, use TF_VAR_... environment variables to provide
[33m│[0m [0mcertain "global" settings to all configurations in your organization. To
[33m│[0m [0mreduce the verbosity of these warnings, use the -compact-warnings option.
[33m╵[0m[0m

```

</details>

*Pushed by: @dsl2022, Action: `pull_request`*